<?php
// 1. Определить сложность следующих алгоритмов:
// - Поиск элемента массива с известным индексом

// Ответ: O(1). 

// - Дублирование одномерного массива через foreach

// Ответ: O(2n)

// - Рекурсивная функция нахождения факториала числа

// Ответ: O(n!)

// - Удаление элемента массива с известным индексом

// Ответ: вот тут точно не могу сказать, ведь при удалении элемента, массив сдвигается и O(1), где происходит одна итерация не подходит. 
// Поэтому предпологаю, что здесь будет O(n), так как кол-во сдвигаемых элементов массива не обусловлено.